tap "homebrew/bundle"
tap "homebrew/services"
brew "autojump"
brew "awscli"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "graphviz"
brew "jenv"
brew "mysql", restart_service: :changed
brew "neovim"
brew "node"
brew "postgresql@14"
brew "pure"
brew "sqlcmd"
brew "swiftformat"
brew "utf8proc", args: ["HEAD"]
brew "vim"
brew "zsh-autosuggestions"
brew "zsh-git-prompt"
brew "zsh-syntax-highlighting"
cask "cursor"
cask "firefox"
cask "git-credential-manager"
cask "github-copilot-for-xcode"
cask "google-chrome"
cask "iterm2"
cask "postman"
cask "swiftformat-for-xcode"
cask "visual-studio-code"
cask "warp"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-workspace"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "openai.openai-chatgpt-adhoc"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
